English/Emotion Intelligence/01 Welcome to the Meeting Debrief.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2024-11-06 Wed 14:43 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>&lrm;</title>
<meta name="author" content="DESKTOP-13B7HQM" />
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="content" class="content">
<div id="outline-container-org4d9576e" class="outline-2">
<h2 id="org4d9576e">01 Welcome to the Meeting Debrief</h2>
<div class="outline-text-2" id="text-org4d9576e">
<p class="verse">
Did you notice all the inappropriate things Cheri did?<br />
I entered the room, another person's meeting, and interrupted their meeting.<br />
I destroyed the meeting's ambiance or environment.<br />
People were shocked.<br />
Did you see their eyes?<br />
I was accusatory.<br />
I was demanding.<br />
I voiced some of the beliefs I had about Jeffrey and teamwork.<br />
What I said can never be erased.<br />
I was haughty and self-indulgent.<br />
I believe that I am better than other people.<br />
I would venture to guess that you are appalled by my behavior.<br />
I am embarrassed every time I watch that!<br />
But Jeffrey also had some issues that I hope you noted.<br />
He didn't stand up for himself.<br />
Perhaps he was afraid.<br />
Perhaps there is fear in this organization.<br />
He and others may not have psychological safety in this company or department.<br />
If that is the case,<br />
&#xa0;then performance will also be lacking or be at a far lower level than it could be.<br />
And everyone around the table is uncomfortable.<br />
They hear Jeffrey's words and feel bad, possibly for Jeffrey, possibly for themselves.<br />
The meeting will never recover from this.<br />
It would be best to cancel the agenda and meet another time.<br />
The behavior of Cheri will always stay in the minds of everyone in that meeting.<br />
Bottom line, it is bad on both sides, Bad Behavior, Bad Culture.<br />
Lack of highly developed social emotional intelligence.<br />
We can all do better.<br />
</p>
</div>
<div id="outline-container-orgabd5f18" class="outline-3">
<h3 id="orgabd5f18">expression</h3>
<div class="outline-text-3" id="text-orgabd5f18">
<p>
debrief [dɪˈbrif]: v. to ask someone questions about a job they have just done or an experience they have just had, in order to gather information ⇨ brief询问<br />
ambiance [ˈæmbiəns]: n. the qualities and character of a particular place and the way these make you feel SYN atmosphere周围环境, 气氛<br />
accusatory [əˈkjuːzətɔːri]: adj. an accusatory remark or look from someone shows that they think you have done something wrong控诉的, 指责的<br />
demanding [dɪˈmændɪŋ]: adj. expecting a lot of attention or expecting to have things exactly the way you want them, especially in a way that is not fair过分要求的, 苛求的<br />
voice [vɔɪs]: v. to tell people your opinions or feelings about a particular subject表达, 吐露<br />
teamwork [ˈtiːmwɜːrk]: n. when a group of people work effectively together合作<br />
erase [ɪˈreɪs]: v. to get rid of something so that it has gone completely and no longer exists抹去, 擦掉, 消磁<br />
haughty [ˈhɔti]: adj. behaving in a proud unfriendly way ⇨ stuck up傲慢的<br />
indulgent [ɪnˈdʌldʒənt] indulge: adj.v. willing to allow someone, especially a child, to do or have whatever they want, even if this is not good for them纵容的<br />
department [dɪˈpɑrtmənt] : n. one of the groups of people who work together in a particular part of a large organization such as a hospital, university, company, or government部门<br />
agenda [əˈdʒendə]: n. a list of problems or subjects that a government, organization etc is planning to deal with日程<br />
intelligent intelligence [ɪnˈtelɪdʒəns]: adj.n. the ability to learn, understand, and think about things智能<br />
</p>
<hr />
<p>
venture to do sth.: 冒险做某事<br />
stand up for sb.: 为某人辩护<br />
stay in the minds of sb.: 留在某人脑海中<br />
The bottom line + &#x2026;: 最重要的是, + &#x2026;<br />
</p>
</div>
</div>
<div id="outline-container-orgda11f1e" class="outline-3">
<h3 id="orgda11f1e">sentence</h3>
<div class="outline-text-3" id="text-orgda11f1e">
<p>
debrief [dɪˈbrif]: v. to ask someone questions about a job they have just done or an experience they have just had, in order to gather information ⇨ brief询问<br />
</p>
<ul class="org-ul">
<li>The scientists who made a remarkable discovery were being debriefing.<br /></li>
<li>The girl who was debriefed was said to be the longest daughter of the lord.<br /></li>
<li>He is always full of energetic when he is debriefed.<br /></li>
</ul>
<p>
ambiance [ˈæmbiəns]: n. the qualities and character of a particular place and the way these make you feel SYN atmosphere周围环境, 气氛<br />
</p>
<ul class="org-ul">
<li>A welcoming ambiance in my hometown did give me a surprise.<br /></li>
<li>The poor child noticed to his horror that there was a hazardous ambiance when he arrived home.<br /></li>
<li>A hazardous ambiance drove him to look everywhere for his cat.<br /></li>
</ul>
<p>
accusatory [əˈkjuːzətɔːri]: adj. an accusatory remark or look from someone shows that they think you have done something wrong控诉的, 指责的<br />
</p>
<ul class="org-ul">
<li>People must have been accusatory when you interrupted another person's meeting.<br /></li>
<li>Why don't you be accusatory?<br /></li>
<li>Your mother is being accusatory, you must have done something forbidden.<br /></li>
</ul>
<p>
demanding [dɪˈmændɪŋ]: adj. expecting a lot of attention or expecting to have things exactly the way you want them, especially in a way that is not fair过分要求的, 苛求的<br />
</p>
<ul class="org-ul">
<li>The demanding accountant is playing naked dance with her tits out.<br /></li>
<li>In sum, my former superior is by no means demanding.<br /></li>
<li>He condemned his superior as a demanding old witch.<br /></li>
</ul>
<p>
voice [vɔɪs]: v. to tell people your opinions or feelings about a particular subject表达, 吐露<br />
</p>
<ul class="org-ul">
<li>The abbot voiced his concern about the monastery's worsening debt.<br /></li>
<li>Although my father has never voiced his concern for me, his kindness stayed in my minds.<br /></li>
<li>The witch voices her compliaint about the lord who burned her house down.<br /></li>
</ul>
<p>
teamwork [ˈtiːmwɜːrk]: n. when a group of people work effectively together合作<br />
</p>
<ul class="org-ul">
<li>There is no teamwork in such a terrible ambiance.<br /></li>
<li>We need more teamwork to achieve our democratic goals.<br /></li>
<li>When he received kindness from his mate, he thought it to be teamwork.<br /></li>
</ul>
<p>
erase [ɪˈreɪs]: v. to get rid of something so that it has gone completely and no longer exists抹去, 擦掉, 消磁<br />
</p>
<ul class="org-ul">
<li>The queen's memory of naked shame parade will never be erased.<br /></li>
<li>Your memory should have been erased, he said in a weak voice.<br /></li>
<li>When he double-checked his answers, he quickly erased the wrong answers.<br /></li>
</ul>
<p>
haughty [ˈhɔti]: adj. behaving in a proud unfriendly way ⇨ stuck up傲慢的<br />
</p>
<ul class="org-ul">
<li>In my childhood, I was spoiled by my grandfather and a little haughty.<br /></li>
<li>The haughty queen was punished to be paraded through the street.<br /></li>
<li>The huaghty knight who didn't obey the rule was sentenced to death by the lord.<br /></li>
</ul>
<p>
indulgent [ɪnˈdʌldʒənt] indulge: adj.v. willing to allow someone, especially a child, to do or have whatever they want, even if this is not good for them纵容的<br />
</p>
<ul class="org-ul">
<li>If you kept indulging your son in your territory, he might meet his death in the continent.<br /></li>
<li>The indulgent girl dared to play truant from school.<br /></li>
<li>The indulgent prince met his death at the hands of the lord Stark.<br /></li>
</ul>
<p>
department [dɪˈpɑrtmənt] : n. one of the groups of people who work together in a particular part of a large organization such as a hospital, university, company, or government部门<br />
</p>
<ul class="org-ul">
<li>Because of unemployment, our department may cease to exist.<br /></li>
<li>The department is blessed with a friendly ambiance.<br /></li>
<li>The department blessed with a friendly ambiance proved more collective intelligent.<br /></li>
</ul>
<p>
agenda [əˈdʒendə]: n. a list of problems or subjects that a government, organization etc is planning to deal with日程<br />
</p>
<ul class="org-ul">
<li>A vacation in Sanya is not on my agenda.<br /></li>
<li>Beyond doubts, there are a lot of vocation on seaside resorts on her agenda.<br /></li>
<li>The meething should be erased on our department's agenda.<br /></li>
</ul>
<p>
intelligent intelligence [ɪnˈtelɪdʒəns]: adj.n. the ability to learn, understand, and think about things智能<br />
</p>
<ul class="org-ul">
<li>The lord offered to provide him with an intelligent robot.<br /></li>
<li>The robot proved intelligent, for it finished a lot house chores which it was not expected to do.<br /></li>
<li>The cooker is intelligent, which can be linked to your application on your phone.<br /></li>
</ul>
<hr />
<p>
venture to do sth.: 冒险做某事<br />
</p>
<ul class="org-ul">
<li>He ventured to make a diary in the memory of his murder.<br /></li>
<li>The crime ventured to publish a fiction about his murder.<br /></li>
<li>My wife ventured to gamble with all of our wealth.<br /></li>
</ul>
<p>
stand up for sb.: 为某人辩护<br />
</p>
<ul class="org-ul">
<li>The primary student says, if you didn't stand up for us, you would be punished in our case in the future.<br /></li>
<li>The usurper lost no time in standing up for his wife.<br /></li>
<li>The woman who stood up for you is being abused in the prison.<br /></li>
</ul>
<p>
stay in the minds of sb.: 留在某人脑海中<br />
</p>
<ul class="org-ul">
<li>Your kindness will always stay in the minds of us.<br /></li>
<li>The natives gave him a state funeral and his honor would stay in the minds of them.<br /></li>
<li>Son, I am pround of you, your honor will stay in the mind of our people.<br /></li>
</ul>
<p>
Bottom line, + &#x2026;: 最重要的是, + &#x2026;<br />
</p>
<ul class="org-ul">
<li>Bottom line, the usurper has already lost his heart in the battle.<br /></li>
<li>Bottom line, these haught knights tend to defect to our side.<br /></li>
<li>Bottom line, your wife is starving to death because of the punishment.<br /></li>
</ul>
</div>
</div>
<div id="outline-container-org1c67237" class="outline-3">
<h3 id="org1c67237">sentence2</h3>
<div class="outline-text-3" id="text-org1c67237">
<p>
debrief [dɪˈbrif]: v. to ask someone questions about a job they have just done or an experience they have just had, in order to gather information ⇨ brief询问<br />
</p>
<ul class="org-ul">
<li>The scientists who made a remarkable discovery were being debriefed.<br /></li>
<li>The girl who was debriefed was said to be the longest daughter of the lord.<br /></li>
<li>He is always full of energetic when he is debriefed.<br /></li>
</ul>
<p>
ambiance [ˈæmbiəns]: n. the qualities and character of a particular place and the way these make you feel SYN atmosphere周围环境, 气氛<br />
</p>
<ul class="org-ul">
<li>A welcoming ambiance in my hometown did surprise me.<br /></li>
<li>The poor child noticed to his horror that there was a hazardous ambiance when he arrived home.<br /></li>
<li>A hazardous ambiance drove him to look everywhere for his cat.<br /></li>
</ul>
<p>
accusatory [əˈkjuːzətɔːri]: adj. an accusatory remark or look from someone shows that they think you have done something wrong控诉的, 指责的<br />
</p>
<ul class="org-ul">
<li>People must have been accusatory when you interrupted another person's meeting.<br /></li>
<li>Why don't you be accusatory?<br /></li>
<li>Your mother is being accusatory, you must have done something forbidden.<br /></li>
</ul>
<p>
demanding [dɪˈmændɪŋ]: adj. expecting a lot of attention or expecting to have things exactly the way you want them, especially in a way that is not fair过分要求的, 苛求的<br />
</p>
<ul class="org-ul">
<li>The demanding accountant is playing naked dance with her tits out.<br /></li>
<li>In sum, my former superior is by no means demanding.<br /></li>
<li>He condemned his superior as a demanding old witch.<br /></li>
</ul>
<p>
voice [vɔɪs]: v. to tell people your opinions or feelings about a particular subject表达, 吐露<br />
</p>
<ul class="org-ul">
<li>The abbot voiced his concern about the monastery's worsening debt.<br /></li>
<li>Although my father has never voiced his concern for me, his kindness stayed in the minds of me.<br /></li>
<li>The witch voices her complaint about the lord who burned her house down.<br /></li>
</ul>
<p>
teamwork [ˈtiːmwɜːrk]: n. when a group of people work effectively together合作<br />
</p>
<ul class="org-ul">
<li>There is no teamwork in such a terrible ambiance.<br /></li>
<li>We need more teamwork to achieve our democratic goals.<br /></li>
<li>When he received kindness from his mate, he thought it to be teamwork.<br /></li>
</ul>
<p>
erase [ɪˈreɪs]: v. to get rid of something so that it has gone completely and no longer exists抹去, 擦掉, 消磁<br />
</p>
<ul class="org-ul">
<li>The queen's memory of the naked shame parade will never be erased.<br /></li>
<li>Your memory should have been erased, he said in a weak voice.<br /></li>
<li>When he double-checked his answers, he quickly erased the wrong answers.<br /></li>
</ul>
<p>
haughty [ˈhɔti]: adj. behaving in a proud unfriendly way ⇨ stuck up傲慢的<br />
</p>
<ul class="org-ul">
<li>In my childhood, I was spoiled by my grandfather and a little haughty.<br /></li>
<li>The haughty queen was punished to be paraded through the street.<br /></li>
<li>The haughty knight who didn't obey the rule was sentenced to death by the lord.<br /></li>
</ul>
<p>
indulgent [ɪnˈdʌldʒənt] indulge: adj.v. willing to allow someone, especially a child, to do or have whatever they want, even if this is not good for them纵容的<br />
</p>
<ul class="org-ul">
<li>If you kept indulging your son in your territory, he might meet his death in the continent.<br /></li>
<li>The indulgent girl dared to play truant from school.<br /></li>
<li>The indulgent prince met his death at the hands of the lord Stark.<br /></li>
</ul>
<p>
department [dɪˈpɑrtmənt] : n. one of the groups of people who work together in a particular part of a large organization such as a hospital, university, company, or government部门<br />
</p>
<ul class="org-ul">
<li>Because of unemployment, our department may cease to exist.<br /></li>
<li>The department is blessed with a friendly ambiance.<br /></li>
<li>The department blessed with a friendly ambiance proved more collectively intelligent.<br /></li>
</ul>
<p>
agenda [əˈdʒendə]: n. a list of problems or subjects that a government, organization etc is planning to deal with日程<br />
</p>
<ul class="org-ul">
<li>A vacation in Sanya is not on my agenda.<br /></li>
<li>Beyond doubt, there are a lot of vocations on seaside resorts on her agenda.<br /></li>
<li>The meeting should be erased from our department's agenda.<br /></li>
</ul>
<p>
intelligent intelligence [ɪnˈtelɪdʒəns]: adj.n. the ability to learn, understand, and think about things智能<br />
</p>
<ul class="org-ul">
<li>The lord offered to provide him with an intelligent robot.<br /></li>
<li>The robot proved intelligent, for it finished a lot house chores which it was not expected to do.<br /></li>
<li>The cooker is intelligent and can be linked to your application on your phone.<br /></li>
</ul>
<hr />
<p>
venture to do sth.: 冒险做某事<br />
</p>
<ul class="org-ul">
<li>He ventured to make a diary in the memory of his murder.<br /></li>
<li>The crime ventured to publish a fiction about his murder.<br /></li>
<li>My wife ventured to gamble with all of our wealth.<br /></li>
</ul>
<p>
stand up for sb.: 为某人辩护<br />
</p>
<ul class="org-ul">
<li>The primary student says, if you didn't stand up for us, you would be punished in our case in the future.<br /></li>
<li>The usurper lost no time in standing up for his wife.<br /></li>
<li>The woman who stood up for you is being abused in the prison.<br /></li>
</ul>
<p>
stay in the minds of sb.: 留在某人脑海中<br />
</p>
<ul class="org-ul">
<li>Your kindness will always stay in the minds of us.<br /></li>
<li>The natives gave him a state funeral and his honor would stay in the minds of them.<br /></li>
<li>Son, I am proud of you, your honor will stay in the minds of our people.<br /></li>
</ul>
<p>
The bottom line + &#x2026;: 最重要的是&#x2026;<br />
</p>
<ul class="org-ul">
<li>The bottom line the usurper has already lost his heart in the battle.<br /></li>
<li>The bottom line these haughty knights tend to defect to our side.<br /></li>
<li>The bottom line your wife is starving to death because of the punishment.<br /></li>
</ul>
</div>
</div>
</div>
</div>
</body>
</html>
